Repository: Flizpay/flizpay-for-woocommerce
Catalog: languages/flizpay-for-woocommerce-*.po
Languages: de_de

source: Settings
de_de: Einstellungen

source: Docs
de_de: Dokumentation

# cashback-title
source: FLIZpay - %s%% Instant-Cashback
de_de: FLIZpay - Bis zu %s%% Rabatt

# cashback-description-both
source: Secure payments in direct collaboration with your bank. After your first FLIZ payment at %s, you will continue to receive %s%% Instant-Cashback.
de_de: Sichere Zahlungen in direkter Zusammenarbeit mit deiner Bank. Nach deiner ersten FLIZ-Zahlung bei %s gibt es weiterhin %s%% Sofort-Cashback.

# cashback-description-standard
source: Secure payments in direct collaboration with your bank. %s%% Instant-Cashback for every FLIZ-payment at %s.
de_de: Sichere Zahlungen in direkter Zusammenarbeit mit deiner Bank. %s%% Sofort-Cashback für jede FLIZ-Zahlung bei %s.

# cashback-description-first
source: Secure payments in direct collaboration with your bank. No additional cashback after your first FLIZ-payment at %s.
de_de: Sichere Zahlungen in direkter Zusammenarbeit mit deiner Bank. Nach deiner ersten FLIZ-Zahlung bei %s gibt es keinen weiteren Cashback.

# title
source: FLIZpay - The Payment Revolution
de_de: FLIZpay - Die Zahlungsrevolution

# description
source: Secure payments in direct collaboration with your bank. We support small businesses and keep your data private â€“ stored securely in Germany.
de_de: Sichere Zahlungen in direkter Zusammenarbeit mit deiner Bank, deine Daten bleiben privat und in Deutschland, und du unterstützt mit FLIZpay kleine Unternehmen.

# cashback-express-title
source: Up to %s%% Instant-Cashback
de_de: Bis zu %s%% Rabatt

# express-title
source: The payment revolution
de_de: Die Zahlungsrevolution

# accept_payments
source: Accept payments via FLIZpay, its 100% free.
de_de: Erhalte gebührenfreie Zahlungen mit FLIZpay.
